In [1]:
#Pivot table

In [2]:
#GroupBy
# In this notebook we are going to see the simple aggregation of data

In [3]:
#import the required libraries

import pandas as pd
import numpy as np

In [4]:
#Sample DataFrame

data = {'key':['A','B','C','A','B','C','A','B','C'],
       'value':[0,5,10,5,10,15,10,15,20]}

df = pd.DataFrame(data)

df

  key  value
0   A      0
1   B      5
2   C     10
3   A      5
4   B     10
5   C     15
6   A     10
7   B     15
8   C     20

In [5]:
df.groupby('key').sum()

     value
key
A       15
B       30
C       45

In [6]:
df.groupby('key').mean()

     value
key
A        5
B       10
C       15

In [7]:
#Load some data

newdf = pd.read_csv("http://bit.ly/wkspdata")

newdf.head()

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
#I want to see the average age for each sex

newdf.groupby('sex').mean().age

sex
female    27.915709
male      30.726645
Name: age, dtype: float64

In [9]:
newdf.groupby('sex')['age'].mean()

sex
female    27.915709
male      30.726645
Name: age, dtype: float64

In [10]:
#calculate the total fare by sex

newdf.groupby('sex')['fare'].sum()

sex
female    13966.6628
male      14727.2865
Name: fare, dtype: float64

In [11]:
newdf.groupby('sex').sum().fare

sex
female    13966.6628
male      14727.2865
Name: fare, dtype: float64

In [12]:
#calculate the average age by embarkation

newdf.groupby('embarked')['age'].mean()

embarked
C    30.814769
Q    28.089286
S    29.445397
Name: age, dtype: float64

In [13]:
#calculate the average age by embarked and furhter by sex

newdf.groupby(['embarked','sex'])['age'].mean()

embarked  sex
C         female    28.344262
          male      32.998841
Q         female    24.291667
          male      30.937500
S         female    27.771505
          male      30.291440
Name: age, dtype: float64

In [14]:
newdf.groupby(['embarked','sex']).mean().age

embarked  sex
C         female    28.344262
          male      32.998841
Q         female    24.291667
          male      30.937500
S         female    27.771505
          male      30.291440
Name: age, dtype: float64

In [15]:
#calculate the survival ratio of the passengers

#number of passengers who survived / total number of passengers

sum(newdf['survived'])/newdf['survived'].count()

0.3838383838383838

In [16]:
newdf['survived'].sum()/len(newdf['survived'])

0.3838383838383838

In [17]:
#HW:

#Calculate the survival ratio of the passengers <= 25 years

newdf2 = newdf[newdf['age'] <=25]
newdf2['survived'].sum()/ len(newdf['survived'])

0.13916947250280584

In [18]:
l1 = [1,2,3,4,5]

len(l1)

5

In [19]:
#Solution:
newdf25 = newdf[newdf['age']<=25] #taking a subpart of the data
newdf25

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
7,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
12,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
877,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S
880,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
882,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
884,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S

In [20]:
#Number of people survuved with age<=25/ Total number of passengers

newdf25['survived'].sum()/len(newdf['survived'])

0.13916947250280584